#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<string.h>

//void test(void)//参数列表的void表示函数默认无参
//{
//	printf("hehe\n");
//}
//
//int main()
//{
//	test(100);//err
//	return 0;
//}


//int main()
//{
//	int a = 20;//4个字节-32bit
//	//00000000000000000000000000010100  -  原码
//	//00000000000000000000000000010100  -  反码
//	//00000000000000000000000000010100  -  补码
//	//0x00000014   -补码在内存中的16进制
//	int b = -10;
//	//10000000000000000000000000001010  -  原码
//	//11111111111111111111111111110101  -  反码
//	//11111111111111111111111111110110  -  补码
//	//0xFFFFFFF6
//
//	return 0;
//}


//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//	//返回1，小端
//	//返回0，大端
//}
//
//
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序(大端或小端）是什么
//	//返回1，小端存储
//	//返回0，大端存储
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}



//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	//-1    -1     255
//	return 0;
//}



//int main()
//{
//	char a = -128;  //整型提升
//	//10000000000000000000000010000000   -   原码
//	//11111111111111111111111101111111   -   反码
//	//11111111111111111111111110000000   -   补码
//
//	printf("%u\n", a);
//	//整型提升
//	//10000000
//	//11111111111111111111111110000000
//
//	//%d  -  打印十进制的有符号整型
//	//%u  -  打印十进制的无符号整型
//
//	return 0;
//}


//int main()
//{
//
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	//按照补码的形式进行运算，最后格式化成为有符号整数
//
//	return 0;
//}
////10000000 00000000 00000000 00010100   -  -20的原码
////11111111 11111111 11111111 11101011   -  -20的反码
//// 
////11111111 11111111 11111111 11101100   -  -20的补码
////00000000 00000000 00000000 00001010   -  10的补码
////11111111 11111111 11111111 11110110   -   结果的补码
////11111111 11111111 11111111 11110101   -   结果的反码
////10000000 00000000 00000000 00001010   -   结果的原码


//
//#include<windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)//无符号数没有负数，程序死循环.
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//
//	return 0;
//}


//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)//存放从-1开始到-128，再-1变成
//	{                         //127，减为0后，再-1变为-1，循环往复
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//求字符串长度，找到字符'0'之前的数，一共255个
//
//	return 0;
//}



//int main()
//{
//	unsigned char i = 0;//0-255
//	for (i = 0; i < 255; i++)
//	{
//		printf("hello world\n");  //程序死循环 在unsigned char中255+1=0
//	}
//
//	return 0;
//}



//9.0  十进制    转换成内存中二进制存储
//1001.0  二进制
//(-1)^0 * 1.001 * 2^3
//(-1)^s *   M   * 2^E  浮点数的二进制科学计数法
//s - 0
//M - 1.001
//E - 3
//
//0.5  (十进制) = 0.1  (二进制)
//(-1)^0 * 1.0 * 2^(-1）
//s = 0
//M =1.0
//E = -1
//E + 127 = 126  E存入内存中要加上E位数的中间值，这里假设是32位float型浮点数

int main()   //说明了浮点数和整数在内存中存储方式不一样
{
	int n = 9;
	//0 00000000 00000000000000000001001 - 补码
	//
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
	//(-1)^0 * 0.00000000000000000001001 * 2^-126  整数的补码9以浮点数形式打印

	*pFloat = 9.0;
	//1001.0
	//1.001 * 2^3
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000000

	printf("num的值为：%d\n", n);//1091567616
	printf("*pFloat的值为:%f\n", *pFloat);//9.000000

	return 0;
}



//int main()
//{
//	float f = 5.5;
//	//5.5(十进制) = 101.1(二进制)
//	//(-1)^0 * 1.011 * 2^2
//	//s=0
//	//M=1.011
//	//E=2
//	//0 10000001 01100000000000000000000 f在内存中的2进制存储
//	//0x40b00000 f在内存中的16进制存储
//
//	return 0;
//}


//E从内存中取出来的三种情况
//①E不为全零或全1：指数E的计算值-127（或1023),得到真实值，再将有效数字M前加上第一位的1
//②E为全0：这时规定指数E为1-127（或1-1023）为真实值，有效数字M不再加上第一位的1。表示无限接近0的很小的值。
//③E全为1:表示一个很大的数，如果有效数字M全为0，表示±无穷大